#include <stdio.h>

int main(void) {

	printf("³í¸®ÇÕ(Âü || Âü) : %d\n", 10 > 0 || 10 < 50);
	printf("³í¸®ÇÕ(Âü || °ÅÁş) : %d\n", 10 < 50 || 10 < 0);
	printf("³í¸®ÇÕ(°ÅÁş || Âü) : %d\n", 10 > 50 || 10 < 50);
	printf("³í¸®ÇÕ(°ÅÁş || °ÅÁş) : %d\n", 10 > 50 || 10 < 0);

	printf("³í¸®°ö(Âü || Âü) : %d\n", 10 > 0 && 10 < 50);
	printf("³í¸®°ö(Âü || °ÅÁş) : %d\n", 10 > 0 && 10 > 50);
	printf("³í¸®°ö(°ÅÁş|| Âü) : %d\n", 10 > 50 && 10 < 50);
	printf("³í¸®°ö(°ÅÁş || °ÅÁş) : %d\n", 10 > 50 && 10 < 0);

	printf("ºÎÁ¤(!Âü) : %d\n", !(10 > 0));
	printf("ºÎÁ¤(!°ÅÁş) : %d\n", !(10 > 100));

	return 0;
}